<?php require_once 'inc/header.php';  # Рендер шапки интерфейса
include 'functions.php';              # Подключение файла функций
require_once 'auth.php'; 							# Подключаем авторизацию
$login = getUserLogin();						  # Выводим переменную $login из авторизации, для дальнейшей проверки
?>

<div align='center'>
   <?php if ($login === null): #Проверяем наличие авторизации ?>
     <a href="/login.php"><h2><strong>Авторизуйтесь</strong></h2></a>
     </div>
   <?php else: #Если авторизация найдена, продолжаем рендер страницы ?>
</div>

<!DOCTYPE html>
<html lang="en">
<head>
	<meta charset="UTF-8">
	<title>Document</title>
</head>
<body>
<hr>
<div class="block-1" align="center">
	<!-- ///////////////////////////////////////////////////////////////////////////////////////////////// -->
	<!-- СОЗДАЁМ ПОЛЬЗОВАТЕЛЬСКУЮ ФОРМУ, ОТКУДА БУДЕМ, В ДАЛЬНЕЙШЕМ, ПРИНИМАТЬ ДАННЫЕ, КОТОРЫЕ ВВЁЛ КЛИЕНТ -->
	<!-- ///////////////////////////////////////////////////////////////////////////////////////////////// -->

  <h3>__Проверка Названия и КПП компании по ИНН__</h3><br>

		<h4>Введите данные ключей интеграции:</h4>
     <form method="post" action="apiDadata.php">
      <p><input type="text" name="token" value="db4bf3ee4593d327241f47abe63596d96cc9989e"><= Введите token из ЛК Dadata.</input></p>
      <p><input type="text" name="inn" value="7722801524"><= Введите ИНН искомой компании.</input></p>
      <p><button type="submit" name="send" value="True"> Отправить </button></p>
     </form>
<hr>
<div align='left'>
  <?php
  $dataHistory = editToken($_POST, $_COOKIE); # Передаём все введённый данные в функцию editToken на создани/перезапись $_COOKIE
  getHistory($dataHistory);                   # Выводим значение $_COOKIE['history'] и красиво показываем в интерфейс
    ?>
</div></div><hr>


<?php endif; # До этого момента рендерим страницу для  авторизованного пользователя?>
<?php
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////// ВЫВОД ПОЛУЧЕННОГО АССОЦИАТИВНОГО МАССИВА ИЗ ФОРМЫ В ИНТЕРФЕЙС ///////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
echo("<div align='center'");
if(isset($_POST['send'])) {
echo "<p><h4>Введёные данные:</h4></p>";
echo "<br>Полученный token: " . $_POST['token'];
echo "<br>Полученный ИНН: " . $_POST['inn'];
echo "<br>Полученный состояние кнопки send: " . $_POST['send'];
echo "<hr></div>";
}

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////// ВЫВОД ВСЕХ ЗНАЧЕНИЙ ГЛОБАЛЬНОГО МАССИВА $_POST ПЕРЕД ОТПРАВКОЙ ЗАПРОСА///////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
if(isset($_POST['send'])) {
echo "<div align='left'><h3> __Полученный массив данных для формирования запроса__</h3>";
  echo "<pre>";
  print_r($_POST);
  echo "</pre></div>";
}
?>

<div align='center'>
  <!-- Отправляет все полученные данные в массиве $_POST в функцию getInfoByInn, получаем обработанный ответ в интерфейс -->
<?php  getInfoByInn($_POST);?>
</div>
</body>
</html>

<?php require_once 'inc/footer.php'  #РЕНДЕР ПОДВАЛА ИНТЕРФЕЙСА ?>
